/*
* Copyright 2002 Brian Bergstrand.
*
* Redistribution and use in source and binary forms, with or without modification, 
* are permitted provided that the following conditions are met:
*
* 1.	Redistributions of source code must retain the above copyright notice, this list of
*     conditions and the following disclaimer.
* 2.	Redistributions in binary form must reproduce the above copyright notice, this list of
*     conditions and the following disclaimer in the documentation and/or other materials provided
*     with the distribution.
* 3.	The name of the author may not be used to endorse or promote products derived from this
*     software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
* WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
* AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
* THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
* $Id$
*/

BBNetUpdateAskTitle = "Vérifier les mises-à-jour?";
BBNetUpdateAskQuestion = "Voulez-vous vérifier l'existence sur le net d'une éventuelle nouvelle version de %@?";

BBNetUpdateNewVersionTitle = "Nouvelle Version Disponible";
BBNetUpdateNoNewVersionTitle = "Pas de Nouvelle Version";
BBNetUpdateCheckNewVersionTitle = "Vérification d'une éventuelle mise-à-jour…";

BBNetUpdateNewVersionAvail = "Vous utilisez actuellement la version %@ de %@. La version %@ est à présent disponible. Voulez-vous télécharger la nouvelle version?";
BBNetUpdateNoNewVersionAvail = "Vous avez la dernière version.";

BBNetUpdateDownloadErrorTitle = "Erreur de Connexion";
BBNetUpdateDownloadError = "Une erreur de connexion est survenue, le téléchargement a été annulé. Raison: '%@'";

BBNetUpdateFileMgrErrorTitle = "Erreur du File Manager";
BBNetUpdateFileMgrError = "Une erreur est survenue lors de la tentative d'enregistrement du fichier %@.";
